Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh686-v3.tmx
Source language: bo
Languages: en

source: །དེ་ནས་དོན་ཡོད་མེ་འབར་བ། །བླ་མེད་འབར་བཟང་བསྒྲུབ་འཚལ་ན། །ཡིད་བཞིན་ནོར་བུ་ལྟ་བུ་དང་།
en: Next is the practice for the vidyā holder who wants to accomplish the amogha blaze fire, a supreme divine fire that is like a wish-fulfilling jewel.

source: །གཟི་བརྗིད་ཉི་མ་དང་མཉམ་པས། །ཕྱོགས་བཅུ་ཁོར་ཁོར་ཡུག་གི། །ཀུན་ནས་སུ་ནི་གསལ་བར་བགྱིད། །སྒྲུབ་པ་རྣམ་པ་སྣ་ཚོགས་དང་། །འཚེད་པ་བླ་ན་མེད་པ་འགྲུབ།
en: It is bright as the rising sun, illuminates the entirety of the ten directions, brings success in the diverse activities, and is the ultimate catalyst for ripening.

source: །བཅུད་ཀྱི་མཆོག་དེ་དམ་པ་ལགས། །ནོར་སྒྱུར་སྨྲ་བ་བླ་ན་མེད། །གཞན་ཡང་འཚེད་པ་སྣ་ཚོགས་པ། །སྒྲུབ་པ་བླ་ན་མེད་པ་ལགས། །ཅི་ལྟར་ཉིན་བཞིན་མཚན་གདའ་བས། །ཉིན་པར་གྱི་ནི་གདུགས་དང་མཚུངས།
en: It is the sublime elixir of longevity, is indispensable in alchemy, produces a variety of excellent results, makes the night bright as day, and is as bright as the daytime sun. “

source: །ལན་ཅིག་དགོས་པ་སྒྲུབ་པ་ན། །ལེགས་པར་ལས་བགྱིས་ནོར་བུ་དང་། །རྫས་བསྲེས་ལེགས་པར་བགྱིས་པ་ལ།
en: To succeed the first time, the vidyā holder must perform the required activities well and mix the precious substances thoroughly.

source: །གཙང་མས་བཟླས་པའི་ལས་རྣམས་དང་། །གཙང་མས་སྤྱད་པས་སྒྲུབ་པ་དང་།
en: If he recites the mantra while ritually pure and practices pure conduct, he will succeed.

source: །དོན་ཡོད་ཆུ་དང་མེ་དང་ནི། །མེ་ཡི་ཤིང་རྣམས་བརྗོད་པར་བགྱི།
en: I will now explain what firewood should be used for the amogha blaze fire.

source: །མེ་འབར་འོད་དང་མཚུངས་པ་སྟེ། །དེ་དག་ཐམས་ཅད་གཅིག་སྤུངས་པའི། །ཡམ་སྲེག་ཆོ་ག་བླ་ན་མེད། །ཙནྡན་དང་ནི་སེང་ལྡེང་དང་། །པ་ཏང་ཀ་ར་བཱི་ར་དང་། །ཨརྐ་ཤ་མི་སྨྱུག་མ་དག །
en: To make the blazing fire evenly bright, the vidyā holder should use all these types of fuel together so that the rite will be the best: sandalwood, khadira, pataṅga, oleander, sticks of giant milkweed, śamī, bamboo, śirīṣa, karṇakārika, bodhi tree, kṣīravṛkṣa, wavy-leaf fig tree, sumanas, gandha, jasmine, and lotus stalks and leaves; the roots, leaves, and flowers of white and blue lotuses and of white water lilies; sticks of wood-apple tree, citron tree, chaste tree, champak, kāṇī, neem tree, vālaka, and citraka.

source: ཤྀར་ཤ་ཀ་ནཱ་ཀི་ར་ཀ །འོ་མའི་ཤིང་དང་བྱང་ཆུབ་ཤིང་། །བླག་ཤ་དང་ནི་སྣ་མ་དང་། །གན་དྷ་བར་ཤི་པདྨ་ཡི། །རྩ་བ་དང་ནི་ལོ་མར་བཅས། །པདྨ་དཀར་པོ་ཀུ་མུ་ད། །ཨུཏྤལ་མེ་ཏོག་ལོ་མ་རྩ། །བཱི་ཛ་པཱུ་ར་བིལ་བ་ཤིང་། །སིན་དུ་བ་ར་ཙམ་པ་ཀ།
en: To perform the rite, the vidyā holder should procure sticks of all these species to use as fuel. “

source: །དྲེ་ཀ་པི་ཙུ་མརྡྷ་དང་། །ས་ཧ་བ་ལ་ཙི་ཏྲ་ཀ །ཤིང་དེ་ཀུན་ག་བསྡུས་པ་ཡིས། །ཡམ་སྲེག་ཤིང་གིས་ལས་བགྱིས་ཏེ། ཡུངས་ཀར་མར་དང་ཞོ་དང་ནི། །སྦྲང་རྩི་འབྲས་ཡོས་སྦྱིན་སྲེག་བགྱི།
en: The oblation should consist of mustard seeds, ghee, curds, honey, and parched rice.

source: །བཟང་པོའི་ཟངས་ལས་སྲང་གསུམ་དང་། །མཚལ་ལས་གཉིས་འགྱུར་གང་བསྐུས་ཀྱང་། །སྲང་གཅིག་ཙནྡན་དཀར་པོ་ཉིད། །སྲང་བཅུ་ལྡོང་རོས་སྲང་གཅིག་སྟེ།
en: Also necessary are three palas of fine copper, twice as much vermillion, one pala of costus, ten palas of white sandalwood, and one pala of realgar.

source: །དེ་དག་བསྲེས་པའི་རྫས་རྣམས་དང་། །དེ་བཞིན་ཡུང་ནི་ཉིས་འགྱུར་དག །
en: These ingredients should be mixed together with twice as much yellow orpiment.

source: ཞི་ག་དག་ནི་བཀང་ནས་སུ། །མེ་ཐབ་དབུས་སུ་གཞུག་པར་བགྱི། །སྦྱིན་སྲེག་སྟོང་ནི་རྩ་བརྒྱད་དུ། །ཤིན་ཏུ་མཉམ་གཞག་ལེགས་གསལ་བ།
en: The vidyā holder should put them in a crucible in the middle of the fire pit and offer one thousand and eight oblations while clear minded and well focused. “

source: །གཙང་མ་གཙང་མར་སྤྱོད་པ་ཡི། །གོས་གཙང་ལེགས་པར་ཁྲུས་བགྱིས་པ། །དྲི་ཞིམ་དྲི་ཡིས་བསྒོས་པར་བགྱི། །རོ་སྣ་ཚོགས་པའི་གཏོར་མ་དང་། །མེ་ཏོག་འབྲས་བུ་ཉིད་ཀྱང་དགོད།
en: Ritually pure, following pure conduct, wearing clean clothes, bathed, and perfumed with scents and fragrances, the vidyā holder should prepare a bali consisting of foods with various flavors, flowers, and fruits.

source: །བཟླས་བརྗོད་ཀྱི་ནི་སྦྱིན་སྲེག་ཉིད། །སྟོང་རྩ་བརྒྱད་ནི་ཚང་བ་དང་། །དེ་ནས་ལྷ་བཤོས་གཏོར་མ་དང་། །མེ་ཏོག་བདུག་པ་མཆོད་ཡོན་སྣོད། །དབུལ་ཏེ་འོ་མས་མདག་མ་དགུམ།
en: When he has completed one thousand and eight recitations and oblations, he should offer the bali composed of food, along with the flowers, incense, and the offering of argha water for the feet.

source: །འོ་མས་ཞི་ག་ཞི་བར་བགྱི།
en: He should then douse the fire with milk and use the milk to cool the crucible.

source: །དེ་ནས་རིག་སྔགས་འཆང་གིས་བཟླས་བརྗོད་སྟོང་རྩ་བརྒྱད་བགྱིས་ནས་ཡུངས་ཀར་གྱིས་བསྣུན་པར་བགྱིའོ། །ཁྲོ་བོའི་རྒྱལ་པོ་ལན་ཉི་ཤུ་རྩ་གཅིག་ཏུ་དབང་བསྐུར་བར་བགྱིའོ།
en: He should strike the crucible with mustard seeds while reciting the mantra one thousand and eight times and then consecrate it twenty-one times with the Krodharāja mantra.

source: །དེ་ནས་ཞིག་འབར་བར་འགྱུར་རོ།
en: The crucible will blaze with light.

source: །དེ་ནས་རིག་སྔགས་འཆང་གིས་ཞི་ག་དེ་ལ་མཆོད་པར་བགྱིའོ། །དེ་ནས་ཟངས་ཀྱི་སྒྲོམ་བུའམ། དངུལ་གྱི་སྒྲོམ་བུར་ཞིག་ནས་ནོར་བུ་བླངས་ཏེ། སྒྲོམ་བུ་དེར་གཞག་པར་བགྱི་སྟེ།
en: The vidyā holder should next make offerings to the crucible and then retrieve the jewel that has formed in the crucible and place it in a copper or silver box.

source: ཡིད་བཞིན་གྱི་ནོར་བུ་ཅི་ལྟ་བ་བཞིན་དུ། འདི་ཡང་དོན་ཡོད་པ་འབར་བ་མཐུ་ཆེན་པོའི་མཐུ་དང་ལྡན་པར་འགྱུར་རོ།
en: Like a wish-fulfilling gem, this amogha blaze will possess tremendous power.

source: །མཚན་མོ་ནི་ཟླ་བའི་འོད་བཞིན་དུ་གདའ་བར་འགྱུར་རོ། །ཉིན་མོ་ནི་ཉི་མའི་འོད་བཞིན་དུ་གདའ་བར་འགྱུར་རོ།
en: At night, it will display the splendor of the moon, and during the day, the splendor of the sun.

source: །ནམ་འཚེད་པའི་དུས་ཀྱི་ཚེ་ནོར་བུ་དེ་བཞག་ན་འཚོ་བ་དང་། སྲེག་པ་དང་། འཚེད་པ་ཐམས་ཅད་འགྲུབ་པར་འགྱུར་རོ། །ནམ་ཧོམ་བགྱིད་པ་དེའི་ཚེ།
en: When preparing food, all acts of nourishment, baking, and cooking can be accomplished by placing the stone in the cooking area.

source: ཐབ་ཀྱི་དབུས་སུ་བཞག་སྟེ། སྲེག་བླུགས་ཀྱིས་སྦྱིན་སྲེག་བགྱིས་ན།
en: When the vidyā holder is performing a homa, he should place the jewel in the middle of the fire pit and pour in the oblations.

source: མེ་ཆེན་པོ་འབར་བར་འགྱུར་རོ།
en: A great fire will blaze forth.

source: །ཐམས་ཅད་ཀྱི་ཐམས་ཅད་དུ་དགོས་པ་རྣམས་སྒྲོན་མས་གསལ་བར་བགྱིས་པ་བཞིན་དུ་འགྱུར་རོ།
en: It will accomplish any tasks anywhere that are difficult to perform. “

source: །གཡུལ་ངོ་ཆེན་པོར་གཡུལ་འགྱེད་པའི་དབུས་སུ་སྐྱེས་པ་དཔའ་བོ་ལེགས་པར་ཁྲུས་བགྱིས་པ། གོས་གཙང་མ་བགོས་པ། ཡ་ལད་དང་གོ་ཆར་གཏམས་པས་ཡིད་བཞིན་གྱི་ནོར་བུ་ཆེན་པོ་དེ་སྤྱི་བོའི་གཙུག་ཏུ་བཞག་ནས། གཅིག་པོ་གཡུལ་གྱི་དབུས་སུ་ཞུགས་ན།
en: In the case of a brave man entering a great battle or a fight, such a person should be well bathed, wear clean clothes, bind his armor, and fasten this great jewel to the top of his head.

source: དེ་ནས་སྐྱེས་པ་དེ་མེ་འབར་བ་གཅིག་པུར་འགྱུར་རོ། །དེ་ནས་གཡུལ་འགྱེད་པའི་ཕ་རོལ་གྱི་དཔུང་རྣམས་ཕམ་པར་གྱུར་ནས།
en: He can then enter the battle alone, where he will turn into a single large flame and defeat the enemy.

source: ཕྱོགས་བཅུར་འཁྲུགས་ནས་འབྱེར་བར་འགྱུར་རོ།
en: They will flee into the ten directions, their spirit broken, and they will never again present any danger.

source: །ཕྱི་ནས་ལན་འགའ་ཡང་ཕ་རོལ་གྱི་དཔུང་དང་། དགྲའི་འཇིགས་པ་འབྱུང་བར་མི་འགྱུར་རོ། །ཕ་རོལ་གྱི་དགྲ་དང་མི་མཛའ་བའི་འཇིགས་པ་འབྱུང་བར་མི་འགྱུར་རོ།
en: Nor there will be any threat from opponents or adversaries. “

source: །ལག་པས་ནོར་བུ་བཟུང་ནས་ཕུག་གི་གནས་སུ་ཞུགས་ན།
en: With the jewel in his hand, the vidyā holder will be able enter passages and homes.

source: གནས་ཀྱི་སྒོ་ཐམས་ཅད་འབྱེ་བར་འགྱུར་རོ། །གནས་ན་གནས་པ་ཐམས་ཅད་མདུན་དུ་མཆིས་པར་འགྱུར་རོ། །ཀླུའི་གནས་ཐམས་ཅད་དུ་མཆིས་ནས།
en: The doors to all the residences will open to him, and all the inhabitants will come out to meet him.

source: ལག་པས་ནོར་བུ་བཟུང་སྟེ། གནས་ཀྱི་ནང་དུ་ཞུགས་ན། ཆབ་ཐམས་ཅད་ཀྱིས་ཕྱིར་མི་ཚུགས་པར་འགྱུར་རོ། །དེ་ནས་ཀླུ་ཐམས་ཅད་མདུན་ན་མཆིས་ནས།
en: If the vidyā holder goes to a nāga dwelling and enters it with the jewel in his hand, water will no longer be found there, and all the nāgas will come before him.

source: བདེན་པར་དམ་བཅའ་བར་འགྱུར་རོ།
en: They will stand by any promise they make.

source: །དབང་དུ་གྱུར་ནས་ཇི་སྲིད་འཚོའི་བར་དུ་ལས་བགྱིད་པར་འགྱུར་རོ། །བསྒོ་བ་བཞིན་བགྱིད་པར་འགྱུར་རོ།
en: Falling under his thrall, they will be his servants for as long as they live, carrying out his every command.

source: །ལོ་ཏོག་དང་རྩྭ་དང་། ཤིང་གེལ་བ་དང་། ནགས་ཚལ་ཐམས་ཅད་བདེ་བར་འཕེལ་བར་འགྱུར་རོ། །མཉེན་ཅིང་མདངས་དང་ལྡན་པ་དང་མཉེན་པར་འགྱུར་རོ། །གཟི་བརྗིད་དང་ལྡན་པ་དང་། དྲན་པ་དང་ལྡན་པ་དང་མི་བདེ་བ་ཡང་ཆུང་བར་འགྱུར་རོ། །སེམས་ཅན་གང་དག་གིས་ཀྱང་ལོ་ཏོག་དང་། མེ་ཏོག་དང་། འབྲས་བུ་ལ་ལོངས་སྤྱོད་པར་འགྱུར་བ་དེ་དག་ཐམས་ཅད་དང་།
en: They will cause all the crops, grass, bushes, and trees to thrive with ease, and any beings who eat these crops or enjoy the flowers or fruits will have a soft and smooth complexion and will be full of energy, mindful, and contented.

source: གཞན་ཆེས་མང་པོ་དག་གིས་དགོས་པ་མང་པོ་བགྱིད་པར་འགྱུར་བ་ནི།
en: The nāgas will also perform many other activities. “

source: ནོར་བུ་ཆེན་པོ་དོན་ཡོད་འབར་བའི་ནོར་བུ་མེ་འབར་བ་ཆེན་པོ་ལགས་སོ།
en: This was the practice of the great jewel, the amogha blaze, the great fiery blaze. “

source: །དེ་ནས་དོན་ཡོད་སྣང་བ་རྣམ་པར་བལྟ་བས། འཕགས་པ་སྤྱན་རས་གཟིགས་དབང་ཕྱུག་བཀུག་སྟེ།
en: Next is the practice of summoning Noble Avalokiteśvara using the radiant amogha gaze.

source: རང་གི་གཟུགས་སུ་ལྟ་བར་འཚལ་ན། དེ་ནས་རིག་སྔགས་འཆང་གཙང་མས་གོས་གཙང་མ་བགོ་བར་བགྱིའོ། །ལུས་ལེགས་པར་བཀྲུས་ཏེ། སྤོས་ཆབ་ཀྱིས་བྱུག་པར་བགྱིའོ། །ཤིང་ཨརྐའི་ཡམ་སྲེག་ཤིང་གིས་མེ་སྦར་བར་བགྱིའོ།
en: The vidyā holder who wants to behold him in person should be ritually pure, bathe thoroughly, wear clean clothes, and perfume his body with scented water.

source: །ཡུངས་ཀར་དང་། ཨ་ག་རུ་དང་། ཙནྡན་དང་། ཞོ་དང་། སྦྲང་རྩི་དང་མར་སྦྱར་བས་སྟོང་རྩ་བརྒྱད་སྦྱིན་སྲེག་བགྱིའོ།
en: He should build a fire with the sticks of giant milkweed and offer one thousand and eight oblations of mustard seeds, agarwood, and sandalwood smeared with curds, honey, and ghee.

source: །དེ་ནས་དོན་ཡོད་ལྕགས་ཀྱུ་གུ་གུལ་ལ་ལན་ཉི་ཤུ་རྩ་གཅིག་གི་སྲེག་བླུགས་ཀྱིས་སྦྱིན་སྲེག་བགྱིས་ན།
en: After that, he should offer bdellium twenty-one times while reciting the mantra of Amoghāṅkuśa.

source: འཕགས་པ་སྤྱན་རས་གཟིགས་དབང་ཕྱུག་རང་གི་གཟུགས་ཀྱིས་མདུན་ན་མཆིས་ནས། མཆོག་ཐམས་ཅད་བསམས་པ་བཞིན་ཡོངས་སུ་རྫོགས་པར་བགྱིད་དོ། །ཇི་ལྟར་ཡིད་ལ་བགྱིད་ཅིང་བསམས་པའི་མཆོག་སྩོལ་བར་བགྱིད་དོ།
en: Noble Avalokiteśvara will appear before the vidyā holder in person to grant him the boons that fulfill all his wishes and that accord with his cherished desires.

source: །དེ་ནས་རིག་སྔགས་འཆང་གིས་ཅི་ལྟར་ཡིད་ལ་བགྱིས་ཤིང་བསམས་པའི་མཆོག་སྨྲས་པ་དང་། དེའི་འོག་ཏུ་འཕགས་པ་སྤྱན་རས་གཟིགས་དབང་ཕྱུག་གིས་ཐམས་ཅད་སྩོལ་བར་བགྱིད་དོ།
en: The vidyā holder needs only to speak of his cherished desires, and Noble Avalokiteśvara will grant them all. “

source: །དེ་ནས་མིག་སྨན་བསྒྲུབ་པར་འཚལ་ན། རིག་སྔགས་འཆང་དེ། ལེགས་པར་བཀྲུས་ཏེ། གཙང་མས་གོས་གཙང་མ་བགོ་བར་བགྱིའོ། །ནུབ་གཅིག་སྨྱུང་བ་བགྱིས་ཏེ།
en: If the vidyā holder wants to accomplish the practice of the magical eye ointment, he should become ritually pure, bathe thoroughly, and wear clean clothes.

source: དེས་ཟངས་ཀྱི་ཟ་མ་ཏོག་བགྱིས་ལ་དེ་ནས་མིག་སྨན་སོའི་བིར་དང་ཡུངས་ཀར་ཉིས་འགྱུར་དུ་བསྲེས་པས་དགང་བར་བགྱིའོ།
en: After fasting overnight, he should construct a round copper box and fill it with one measure of collyrium mixed with two measures of yellow orpiment.

source: །དེ་ནས་སྟོང་རྩ་བརྒྱད་བཟླས་བརྗོད་བགྱིས་ནས། ཐབ་ཀྱི་དབུས་སུ་གཞག་པར་བགྱིའོ། །དེའི་སྟེང་དུ་ཨུ་ཤྀ་ར་དང་།
en: After incanting it one thousand and eight times, he should place it in the middle of the fire pit.

source: ཡུངས་ཀར་དང་། ཙནྡན་དང་། ཞོ་དང་སྦྲང་རྩི་དང་། མར་བསྲེས་པས་ལན་སྟོང་རྩ་བརྒྱད་སྦྱིན་སྲེག་བགྱིའོ། །ཤིང་ཨརྐའི་མེ་སྦར་བར་བགྱིའོ།
en: Upon this fire made of giant milkweed, he should then cast one thousand and eight oblations of vetiver root, mustard seeds, and sandalwood that has been smeared with curds, honey, and ghee.

source: །ལན་སྟོང་རྩ་བརྒྱད་ཚང་བ་དང་། དེ་ནས་མིག་སྨན་བླངས་ལ་གཏུན་གྱི་སྟེང་དུ་ལེགས་པར་ཞིབ་ཏུ་བཏགས་ལ་ལྡོང་རོས་དང་།
en: When he has reached the number one thousand and eight, he should retrieve the ointment and grind it in a stone mortar into a fine powder, adding realgar, camphor, and musk.

source: ག་པུར་དང་གླ་རྩིར་བསྲེས་ནས་སླར་ཡང་དོན་ཡོད་པའི་ཞགས་པའི་སྙིང་པོ་ལན་བརྒྱ་རྩ་བརྒྱད་བཟླས་བརྗོད་བགྱིས་ལ་དོན་ཡོད་ལྕགས་ཀྱུའི་རིག་སྔགས་རྒྱལ་པོ་ལན་ཉི་ཤུ་རྩ་གཅིག་བཟླས་བརྗོད་བགྱིས་པ་ནི་ཐམས་ཅད་དུ་མགུལ་ལ་ལེགས་པར་སྦྱར་ཏེ།
en: He should incant the mixture one hundred and eight times with the heart mantra of Amoghapāśa and twenty-one times with the king of vidyās Amoghāṅkuśa.

source: དེ་ནས་དོན་ཡོད་རྒྱལ་པོས་དབང་བསྐུར་བར་བགྱིའོ།
en: This mixture can always be employed in acts of summoning. “

source: །དོན་ཡོད་ཞགས་པའི་ཕྱག་རྒྱས་ལན་བདུན་ཕྱག་རྒྱ་བཅིང་ངོ་།
en: He should then consecrate the mixture with the Amogharāja mantra while forming the mudrā of Amoghapāśa seven times.

source: །དེ་ནས་མིག་སྨན་གྱིས་བྱུགས་ན་ནམ་མཁའ་ལ་འཕུར་ནས་རིག་སྔགས་འཆང་ཐམས་ཅད་ཀྱི་དཔོན་པོར་འགྱུར་རོ།
en: If he then anoints his eyes with this mixture, he will fly up into the sky and become the overlord of all vidyādharas.

source: །སྐྲ་ཅུང་ཟད་འཁྱིལ་བར་ཡང་འགྱུར་རོ། །བསྐལ་པ་ཁྲིར་འཚོ་བར་འགྱུར་རོ།
en: His hair will turn wavy and curly, and he will live for ten thousand eons.

source: །དབྲལ་བར་ཐིག་ལེ་བགྱིས་ན་མི་གདའ་བར་འགྱུར་རོ།
en: If he uses the mixture to mark a bindi on his forehead, he will become invisible.

source: །མིག་ལ་བསྐུས་ཏེ་ཚིག་གཞན་མི་སྨྲ་བར་རྒྱལ་པོའི་ཕོ་བྲང་དུ་ཞུགས་ན། རྒྱལ་པོ་བཙུན་མོའི་འཁོར་དང་བཅས་པ་དབང་དུ་གྱུར་ནས་མཆིས་པར་འགྱུར་རོ།
en: If he anoints his eyes and enters a royal palace without speaking to anyone, the king, his harem, and his retinue will fall under and remain in his thrall.

source: །མཆོད་པ་ཕལ་པོ་ཆེས་ཆེར་མཆོད་པར་འགྱུར་རོ། །ནོར་འདུ་པ་གྲུབ་པ་ཆེན་པོ་ཐོབ་པར་འགྱུར་རོ།
en: As a great person, he will be much venerated and will be successful in accumulating great wealth. “

source: །སྒྲུབ་པའི་དུས་སམ། བཟླས་བརྗོད་ཀྱི་དུས་སུ་མིག་ལ་བསྐུས་ན་བགེགས་དང་ལོག་འདྲེན་དང་། བདུད་ཀྱི་རིས་ཀྱི་ལྷ་རྣམས་ཐམས་ཅད་ཀྱིས་མི་མཐོང་བར་འགྱུར་རོ།
en: If the vidyā holder anoints his eyes when practicing, or during recitation, he will become invisible to all vighnas, vināyakas, and the deities in the company of Māra.

source: །ཕྱིས་ཀྱང་བགེགས་བྱེད་པར་མི་ནུས་ཏེ་བར་ཆད་བགྱིད་པར་མི་འགྱུར་རོ། །བདེ་བ་སྒྲུབ་པའི་ཆོ་ག་དང་བཟླས་བརྗོད་ཀྱི་ཆོ་ག་འགྲུབ་པར་འགྱུར་རོ།
en: They will no longer be able to impede him or create obstacles, and he will easily succeed in the ritual procedure.

source: །མིག་ལ་བྱུགས་ཏེ་སྐྱེ་བོ་མང་པོའི་ནང་དུ་ཞུགས་ན་དེ་དག་ཐམས་ཅད་དབང་དུ་གྱུར་ཏེ།
en: If he anoints his eyes and enters a great crowd of people, everyone will fall under his thrall.

source: ནོར་དང་། འབྲུ་དང་། གོས་དང་། ལྷབ་ལྷུབ་རྒྱན་ཕལ་པོ་ཆེ་འགྲུབ་པར་འགྱུར་རོ།
en: He will acquire a lot of money, grain, clothes, ornaments, and adornments.

source: །བུད་མེད་ཀྱང་མིག་མི་འཛུམས་པར་ལྟ་བཞིན་དུ་བདག་ཉིད་དམ་ནོར་དབང་དུ་འགྱུར་རོ། །མིག་ལ་བྱུགས་ཏེ་དགོན་པོ་ཆེན་པོར་ཞུགས་ན། ཆོམ་པོ་དང་། གཡོན་ཅན་དང་། རྐུན་པོ་དང་།
en: If he gazes at a woman without blinking, she will become enthralled, and she will be at his disposal along with her wealth.

source: གཅན་གཟན་གདུག་པ་དང་། སྦྲུལ་དང་། དབྱིག་དུག་དང་། སྦྲུལ་གྱི་དུག་གི་འཇིགས་པ་ཐམས་ཅད་འབྱུང་བར་མི་འགྱུར་ཏེ། བདེ་ལེགས་སུ་སླར་མཆི་བར་འགྱུར་རོ།
en: If he anoints his eyes and enters a great forest, he will not be in any danger from thieves, bandits, robbers, wild animals, or poisonous and nonpoisonous creatures, and he will pass through it easily and safely. “

source: །འཐབ་མོ་དང་རྩོད་པ་དང་འགྱེད་པ་ཐམས་ཅད་ལ་མིག་སྨན་བསྐུས་ན། སྨྲ་བ་རྣམས་ཀྱི་བླ་ན་མེད་པར་འགྱུར་ཏེ། ཐམས་ཅད་དུ་རྒྱལ་བར་འགྱུར་རོ།
en: In the event of quarrels, disputes, contests, or squabbles, the vidyā holder should anoint his eyes; his claims will be unmatched, and he will be victorious.

source: །གཡུལ་ངོར་གཡུལ་འགྱེད་པའི་ནང་དུ་མཆིས་ནས་མིག་ལ་བྱུགས་ན། ཐམས་ཅད་ལས་རྒྱལ་བར་འགྱུར་ཞིང་། འཇིགས་པ་ཐམས་ཅད་ལས་བསྒྲལ་བར་འགྱུར་རོ།
en: If, while a war rages, he anoints his eyes and enters into the thick of the battle, he will always be victorious and free from all danger.

source: །གདུག་པས་ཟིན་པ་ཐམས་ཅད་ལ་མིག་ལ་བསྐུས་ན། གདུག་པ་མ་མཆིས་པར་འགྱུར་རོ།
en: If he anoints his eyes after being exposed to poison from a bite, the poison will be neutralized.

source: །རིམས་ཞག་གཅིག་པ་དང་། ཞག་གཉིས་པ་དང་། ཞག་གསུམ་པ་དང་། རིགས་ཞག་བཞི་བ་ཐམས་ཅད་ལ་མིག་ལ་བསྐུས་ན། རིམས་ཐམས་ཅད་ལས་གྲོལ་བར་འགྱུར་རོ།
en: If he anoints his eyes when fever strikes, whether the fever returns every day or every two, three, or four days, he will be cured.

source: །དུག་མི་བཟད་པར་འཚལ་བ་ལ་མིག་ལ་བསྐུས་ན་དུག་མ་མཆིས་པར་འགྱུར་རོ།
en: If he anoints his eyes after drinking poison, the poison will be neutralized. “

source: །གདོན་ཐམས་ཅད་ཀྱིས་ཟིན་པ་ལ་མིག་ལ་བསྐུས་ན། གདོན་བརྒྱད་ཁྲི་བཞི་སྟོང་ལས་ཐར་བར་འགྱུར་རོ།
en: If the vidyā holder anoints his eyes when seized by any graha, he will be freed from the influence of the eighty-four thousand grahas.

source: །མིག་བྲོ་འཚལ་བ་ལ་བསྐུས་པ་ཙམ་གྱི་མོད་ལ་བྱང་བར་འགྱུར་རོ།
en: If afflicted with eye pain, it will be cleared away the moment he anoints his eyes.

source: །ཀླད་པ་ཆེར་བྲོ་འཚལ་བ་ཡང་མིག་ལ་བསྐུས་པ་ཙམ་གྱིས་བྱང་བར་འགྱུར་རོ།
en: If he anoints his eyes when suffering from an acute headache or edema, he will be cured immediately.

source: །ཚངས་པའི་སྲིན་པོའི་གདོན་དང་། བརྗེད་བྱེད་ཀྱིས་ཟིན་པ་ལ་ཡང་མིག་ལ་བསྐུས་པ་ཙམ་གྱིས་ཐར་བར་འགྱུར་རོ།
en: When seized by brahmarākṣasas or apasmāras, he will be released from the seizure the moment he anoints his eyes.

source: །རྒྱལ་པོ་ཁྲོས་པས་གསོད་པར་འོས་པ་གང་སུ་ཡང་རུང་བ་ཁྲིད་པ་ལ་མིག་ལ་བསྐུས་པ་ཙམ་གྱིས་འཇིགས་པ་ཐམས་ཅད་སྤངས་པའི་ཐར་བར་འགྱུར་རོ།
en: Those to be led to their execution for incurring a king’s wrath will be freed the moment they anoint their eyes, and they will have nothing to fear. “

source: །ནག་པོ་ཆེན་པོའི་མིག་ལ་བསྐུས་ན་རང་གི་གཟུགས་ཀྱིས་དུས་སུ་མདུན་ན་མཆིས་ནས་མཆོག་ཐམས་ཅད་སྩོལ་ཅིང་དགོས་པ་ཐམས་ཅད་བགྱིད་པར་འགྱུར་རོ། །མ་མོའི་ཚོགས་ཐམས་ཅད་དབང་དུ་གྱུར་ནས་མཆིས་པར་འགྱུར་རོ། །དཔལ་ལྷ་མོའི་མིག་ལ་བསྐུས་ཏེ།
en: If the vidyā holder anoints the eyes of an image of Mahākāla, Mahākāla will appear before him in person to grant boons and perform all tasks, and the entire host of mātṛs will fall under his thrall.

source: མིག་མི་འཛུམས་པར་དོན་ཡོད་རྒྱལ་པོའི་སྙིང་པོ་ལན་བདུན་བཟླས་ན།
en: If he anoints the eyes of an image of the goddess Śrī and gazes at her without blinking while reciting the heart mantra of Amogharāja three times, the great goddess will appear before him.

source: དཔལ་ལྷ་མོ་ཆེན་མོ་མཆིས་ནས་དགོས་པ་ཐམས་ཅད་དང་། །འབྲུ་མང་པོ་རབ་ཏུ་སྩོལ་བར་འགྱུར་རོ།
en: She will accomplish all his tasks and bestow upon him great wealth. “

source: །ཉལ་བའི་ཚེ་མིག་ལ་བསྐུས་ནས་ཉལ་ན། རྨི་ལམ་བཟང་པོ་མང་ཞིང་ཕལ་ཆེ་བ་མཐོང་བར་འགྱུར་རོ།
en: If the vidyā holder anoints his eyes when he goes to sleep, he will have many wonderful dreams.

source: །འཕགས་པ་སྤྱན་རས་གཟིགས་དབང་ཕྱུག་རང་གི་གཟུགས་མཐོང་བ་སྩོལ་བར་འགྱུར་རོ། །མཆོག་ཐམས་ཅད་སྩོལ་བར་འགྱུར་རོ།
en: Noble Avalokiteśvara will appear before him in person and grant him every boon.

source: །དྲན་པ་དང་བློ་གྲོས་རྒྱ་ཆེན་པོར་འགྱུར་རོ།
en: He will develop excellent memory and intelligence.

source: །མིག་ལ་བསྐུས་ཏེ་ཚོགས་ཀྱི་དབུས་སུ་ཞུགས་ན་མཆོད་པ་ཆེན་པོ་ཐོབ་པར་འགྱུར་རོ།
en: If he anoints his eyes and enters a crowd of people, he will be greatly revered.

source: །འཕགས་པ་སྤྱན་རས་གཟིགས་དབང་ཕྱུག་གི་གཟུགས་བརྙན་གྱི་མིག་ལ་བསྐུས་ན། རྟག་ཏུ་མཆོག་སྩོལ་བར་འགྱུར་རོ། །རྟག་ཏུ་བལྟ་འཚལ་བར་འགྱུར་རོ།
en: If he anoints the eyes of an image of Noble Avalokiteśvara, he will always receive boons from him and will be able to see him whenever he desires. “

source: །གི་ཝང་དང་ལྷན་ཅིག་སྦྱར་ཏེ་མིག་ལ་བསྐུས་ནས་རྒྱལ་པོའི་ཕོ་བྲང་དུ་ཞུགས་ན་དབང་ཕྱུག་རྒྱ་ཆེན་པོ་ཐོབ་པར་འགྱུར་རོ། །ལོངས་སྤྱོད་ཆེན་པོ་ཕུན་སུམ་ཚོགས་པར་ཡང་འགྱུར་རོ། །དོན་ཆེན་པོ་འགྲུབ་པར་ཡང་འགྱུར་རོ།
en: If the vidyā holder anoints his eyes with the same eye ointment combined with bovine bezoar and then enters a royal palace, his power and influence will greatly increase, and he will obtain great pleasures and prosperity and accumulate much wealth.

source: །རྒྱལ་པོའི་བཙུན་མོ་དང་བློན་པོའི་ཚོགས་དང་། འཁོར་ཐམས་ཅད་དགའ་བར་གྱུར་ནས།
en: He will be loved by the king and by his harem and ministers, as well as by their retinues.

source: ཐམས་ཅད་དབང་དུ་གྱུར་ཏེ་མཆིས་པར་འགྱུར་རོ།
en: They will all fall under his thrall. “

source: །དཔལ་ལྷ་མོ་ཆེན་མོའི་གཟུགས་བརྙན་གྱི་མིག་ཏུ་བསྐུས་ན།
en: If the vidyā holder anoints the eyes of an image of Mahādeva, he will become an overlord of all bhūtas.

source: འབྱུང་པོ་ཐམས་ཅད་ཀྱི་བདག་པོར་འགྱུར་ཞིང་ལས་བགྱི་བ་ཅི་མཆིས་ཞེས་ཐམས་ཅད་དབང་དུ་གྱུར་ནས་མཆིས་པར་འགྱུར་རོ།
en: They will all remain under his thrall and serve him by performing all his activities.

source: །ནག་པོ་ཆེན་པོའི་གཟུགས་བརྙན་གྱི་དཔྲལ་བ་དང་མིག་ལ་བསྐུས་ན། གནོད་སྦྱིན་ཐམས་ཅད་དབང་དུ་འགྱུར་རོ།
en: If he anoints the eyes and forehead of an image of Mahākāla, all yakṣas will fall under his thrall.

source: །མི་རོའི་མིག་ལ་བསྐུས་ན་ལྡང་བར་འགྱུར་རོ། །གསང་སྔགས་དང་།
en: If he anoints the eyes of a corpse, it will be revived.

source: དུག་སྦྱར་མ་དང་། བྱད་ཀྱིས་ཟིན་པ་ཐམས་ཅད་ཀྱི་མིག་ལ་བསྐུས་ན་དུག་སྦྱར་མ་དང་། བྱད་དང་། གསང་སྔགས་ཐམས་ཅད་བཤིག་པར་འགྱུར་ཞིང་ལན་འགའ་ཡང་སླར་ཟིལ་གྱིས་གནོན་པར་མི་འགྱུར་རོ།
en: If he anoints the eyes of any mantra deities, garas, or kākhordas, they will all be done away with and will never trouble him again. “

source: །བཀྲེས་པའི་མིག་ལ་བསྐུས་ཏེ།
en: If the vidyā holder is hungry, he should anoint his eyes and enter a city.

source: གྲོང་དུ་ཞུགས་ནས་བཟའ་བ་དང་བཏུང་བའི་སྟོན་མོ་ལྷུན་གྱིས་གྲུབ་ཅིང་འཐོབ་པར་འགྱུར་རོ།
en: He will effortlessly acquire a feast of food and drink.

source: །བསོད་སྙོམས་པའི་མིག་ལ་བསྐུས་ཏེ། བསོད་སྙོམས་ལ་མཆིས་ན། ཁ་ཟས་སྣ་ཚོགས་མང་པོ་དང་། ཡོན་ཕལ་པོ་ཆེ་འཐོབ་པར་འགྱུར་རོ། །སྨེ་བ་དང་། ལིང་ཏོག་དང་། རབ་རིབ་དང་། ཆུ་བུར་དང་། མཚན་མོ་འཐོམ་པ་དང་།
en: If, as an alms seeker, he anoints his eyes when making his alms rounds, he will obtain plentiful food of various tastes, as well as plentiful offerings.

source: གཡའ་བ་དང་། ཚག་པོ་དང་། མིག་གི་རྫི་མ་རྡུང་བ་དང་། མིག་སླེ་བོ་དེ་དག་ཐམས་ཅད་ཞི་བར་འགྱུར་རོ། །མིག་ནད་ཐམས་ཅད་ལས་སོས་པར་འགྱུར་རོ།
en: He will be able to cure all eye diseases, such as bleary eyes, cataracts, partial blindness, eye tumors, night blindness, itching, discharge, foreign objects in the eye, boils, and swelling, and he will regain his health.

source: །ལྷའི་མིག་དག་པ་འདབ་བཟངས་དང་མཚུངས་པ་འདབ་བཟངས་ཀྱི་མཐོང་བ་ཐོབ་ནས་ཐམས་ཅད་ཀྱི་སྙིང་དུ་སྡུག་པ་དང་དབང་དུ་གྱུར་ནས་ནོར་རྙེད་པ་དང་དོན་གྲུབ་པ་ཡང་ཐོབ་ནས།
en: With his divine sight purified, he will be, like a bird, able to see everything pleasing and will be able to bring it under his control.

source: དབང་ཕྱུག་བླ་ན་མེད་པར་འགྱུར་རོ། །དེ་ནས་ནོར་དང་། འབྲུ་དང་། གོས་དང་།
en: He will obtain money, grain, and great influence. “

source: ལྷབ་ལྷུབ་དང་། རྒྱན་དང་། རྒྱན་འཕྱང་ཐམས་ཅད་དགུག་པ་དང་། འཕེལ་བར་བགྱིད་པ་དང་། དོན་ཡོད་མེ་ལྷ་དགུག་པའི་སྦྱིན་སྲེག་རྒྱ་ཆེན་པོ་བརྗོད་པར་བགྱིའོ།
en: Now I will teach the elaborate homa rite that unfailingly summons the god of fire in order to attract and increase everything, including wealth, grain, clothes, jewelry, adornments, and ornaments.

source: །གྲུབ་པ་ཀུན་གྱི་བླ་ན་མེད། །དོན་ཀུན་གྲུབ་པས་མོད་ལ་ནི། །མཁས་པ་མཆོག་ཏུ་དགའ་བར་བགྱིད། །དབང་ཕྱུག་སྐལ་བ་ཕུན་སུམ་ཚོགས།
en: This rite brings the ultimate accomplishment, the instantaneous accomplishment of all goals, and brings supreme happiness to the learned.

source: །མོད་ཉིད་ཁོ་ནར་ཐོབ་འགྱུར་བར།
en: Through this rite, the vidyā holder will instantly obtain influence, pleasure, and abundance.

source: །ཐེ་ཙོམ་དུ་ཡང་མི་བགྱི་ཞིང་།
en: This should not be doubted, nor should there be uncertainty or ambivalence. “

source: །ཡིད་གཉིས་ཉིད་ཀྱང་མ་ལགས་སོ།
en: The material benefits of this supreme homa rite are inconceivably great.

source: །གཙང་མས་གཙང་མའི་གོས་དག་དང་། །ལེགས་པར་བཀྲུས་པས་ལས་སྒྲུབ་བོ། །སྦྱིན་སྲེག་བླ་ན་མེད་འཕེལ་བ། །འདི་ནི་རྒྱ་ཆེན་བསམ་མི་ཁྱབ།
en: It should be performed by a vidyā holder who is ritually pure, thoroughly bathed, and wearing clean clothes.

source: །ཀ་རན་རྩ་བ་སྡོང་བུར་བཅས། །འདབ་མ་མེ་ཏོག་འབྲས་བུར་བཅས། །ཨརྐའི་ཤིང་དང་བླག་ཤའི་ཤིང་། །ཡམ་སྲེག་དག་གིས་མེ་སྦར་ལ།
en: He should procure the root, sticks, leaves, flowers, and fruits of pongamia oil tree and kindle the fire using sticks of giant milkweed and white fig tree.
